## Staging: cloudfront
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
iam.tf
```
```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                 |
|--------|---------------------------------------------------------------------|
| update | `aws_kms_key.wafv2-log-group-kms-key`                               |
| add    | `aws_cloudwatch_log_group.wafv2-log-group`                          |
|        | `aws_wafv2_web_acl_logging_configuration.waf_logging_configuration` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.wafv2-log-group will be created
  + resource "aws_cloudwatch_log_group" "wafv2-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:843973686572:key/c424320d-2228-464a-9943-e81e978add8f"
      + name              = "aws-waf-logs-url-shortener"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_kms_key.wafv2-log-group-kms-key will be updated in-place
  ~ resource "aws_kms_key" "wafv2-log-group-kms-key" {
        id                                 = "c424320d-2228-464a-9943-e81e978add8f"
      ~ policy                             = jsonencode(
          ~ {
              - Id        = "key-default-1" -> null
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::843973686572:root" -> "arn:aws:iam:::root"
                        }
                      ~ Resource  = "*" -> "arn:aws:kms:::key/*"
                      ~ Sid       = "Enable IAM User Permissions" -> "AllowKMSAllAccess"
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ca-central-1:843973686572:log-group:aws-waf-logs-url-shortener/"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ca-central-1.amazonaws.com"
                        }
                      + Resource  = "arn:aws:kms:::key/*"
                      + Sid       = "AllowKMSAccessToCloudWatchLogs"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags                               = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.waf_logging_configuration will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "waf_logging_configuration" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:us-east-1:843973686572:global/webacl/url-shortener-waf/3b75fcdd-f01d-467b-92c2-cbb021fea8e9"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
